export const conversationData = [
    {
        id: 1,
        botMessage: 'مرحباً! كنا ننتظر قدوم شخصًا ما، وها انت ذا. يالها من مفاجأة.',
        options: [
            { text: 'مرحبًا!', nextId: 2, score: 0 },
            { text: 'من أنت...؟', nextId: 3, score: 0 }
        ]
    },
    {
        id: 2,
        botMessage: 'سمعت انك جئت لتصبح نجم الصحافة القادم... حسنًا دعنا نرى ذلك.',
        options: [
            { text: 'أنا مستعد!', nextId: 4, score: 0 }
        ]
    },
    {
        id: 3,
        botMessage: 'هذا سر، هل أنت مستعد لتقبل أن هذه اللعبة ليست سهلة؟',
        options: [
            { text: 'أنا قادم من أجل التحدي!', nextId: 100, score: 0 },
            { text: 'يا له من غموض ...', nextId: 100, score: 0 }
        ]
    },
    {
        id: 100,
        botMessage: 'لنبدأ إذًا!',
        options: [
            { text: 'التالي', nextId: 4, score: 0 },
        ]
    },
    {
        id: 4,
        botMessage: 'صفحتك فارغة تمامًا... قم بنشر أول عمل لك! بماذا تريد ان تبدأ؟',
        options: [
            { text: 'قصة إنسانية', nextId: 5, score: 0 },
            { text: 'تقرير صحفي', nextId: 6, score: 0 },
            { text: 'خبر', nextId: 7, score: 0 },
        ],
    },
    // 🟢 "قصة إنسانية"
    {
        id: 5,
        botMessage: 'أيّها تريد نشره؟',
        options: [
            { text: 'شاب يحول حيه إلى قصة دعم للأسر المحتاجة.', nextId: 8, score: 10 },
            { text: 'بطل مجهول : 40 عامًا من العطاء الصامت', nextId: 9, score: 10 },
            { text: 'أحمد يهزم السرطان! اكتشاف علاج سري جديد يغير  قواعد اللعبة.', nextId: 10, score: 0 },
        ],
    },
    // 🟢 "تقرير صحفي"
    {
        id: 6,
        botMessage: 'أيّها تريد نشره؟',
        options: [
            { text: 'الذكاء الاصطناعي يغير قواعد اللعب في سوق العمل!', nextId: 11, score: 10 },
            { text: 'وثائق سرية تكشف : خطة دولية عمرها 50 عامًا وراء ما يحدث اليوم !', nextId: 12, score: 0 },
            { text: 'المدن تتنفس .... مشاريع خضراء لتحسين جودة الحياة.', nextId: 13, score: 10 },
        ],
    },
    // 🟢 "خبر"
    {
        id: 7,
        botMessage: 'أيّها تريد نشره؟',
        options: [
            { text: 'مصدر مجهول يكشف تورط مسؤول بارز في قضية فساد!', nextId: 14, score: 0 },
            { text: 'خبراء يكشفون عن كارثة وشيكة في المدينة خلال أيام !', nextId: 15, score: 0 },
            { text: 'جامعات تعتمد نظام التعليم الهجين لرفع جودة التعليم.', nextId: 16, score: 10 },
        ],
    },
    // 🟢 نتائج "قصة إنسانية"
    {
        id: 8,
        botMessage: 'للإنسانية مكانًا دائمًا في الصحافة، أحسنت الاختيار! هل ترغب في أن ترى ما كتبه الجمهور؟',
        options: [
            { text: 'متشوق لسماع رأي الجمهور !', nextId: 17, score: 0 },
        ],
    },
    {
        id: 9,
        botMessage: 'هذا النوع من القصص لا يقرأ فحسب، بل يحترم. هل تود أن نسمع رأى الناس في هذا البطل؟',
        options: [
            { text: ' نعم، لنمنحه ضوءًا يستحقه!', nextId: 18, score: 0 },
        ],
    },
    {
        id: 10,
        botMessage: 'لو كان العلاج سريًا فعلًا، لما وصل إلينا بهذه السرعة.هل نكشف رأي الجمهور أم نحتفظ بسر أحمد ؟',
        options: [
            { text: 'أرني ما كتبوه', nextId: 19, score: 0 },
            { text: 'دع السر يبقى في المختبر', nextId: 26, score: 0 },
        ],
    },
    // 🟢 نتائج "تقرير صحفي"
    {
        id: 11,
        botMessage: 'يبدو أن المستقبل وصل أسرع مما كنا نتوقع، هل ترغب أن نرى كيف استقبل الناس هذه الثورة الذكية ؟',
        options: [
            { text: 'نعم، أرني حماسهم.', nextId: 20, score: 0 },
        ],
    },
    {
        id: 12,
        botMessage: 'هل تظن أن الصحافة ميدانًا للتكهنات ...؟ هل ترغب أن ترى ما قاله الجمهور عن هذا "الاكتشاف" المثير؟',
        options: [
            { text: 'نعم، فلنری ردودهم', nextId: 21, score: 0 },
            { text: 'لا، دعنا نغلق الملف بسرية', nextId: 26, score: 0 },
        ],
    },
    {
        id: 13,
        botMessage: 'يبدو أنك قررت نشر بعض التفاؤل في هذا العالم المزدحم.هل نشارك الجمهور نسمة الأمل ؟',
        options: [
            { text: 'نعم ،  دعنا نسمعهم.', nextId: 22, score: 0 },
        ],
    },
    // 🟢 نتائج "خبر"
    {
        id: 14,
        botMessage: 'أوه ... مصدر مجهول ؟ هذا الخبر يبدأ بالريبة قبل أن يبدأ بالكلمات.هل ترغب برؤية رأي الجمهور قبل أن تنكشف القصة تمامًا؟ ',
        options: [
            { text: 'أطلعني عليها.', nextId: 25, score: 0 },
            { text: 'لنغلق الملف قبل  أن يتحول إلى أزمة', nextId: 26, score: 0 },
        ],
    },
    {
        id: 15,
        botMessage: 'يبدو أنك قررت أن تخيف الناس، هل تود أن نرى ردة فعلهم؟',
        options: [
            { text: 'دعنا نواجه العاصفة', nextId: 23, score: 0 },
            { text: 'لا، لنؤجل الكارثة قليلًا', nextId: 26, score: 0 },
        ],
    },
    {
        id: 16,
        botMessage: 'أخيرًا خبر يبعث الطمأنينة بدل التوتر! هل نشارك الجمهور هذا الارتياح ؟',
        options: [
            { text: 'نعم، أطلعني على آرائهم', nextId: 24, score: 0 },
        ],
    },
    {
        id: 17,
        botMessage: '  مؤشرات القبول مرتفعة، هذا جيد ! ',
        publicComments: [
            "مريم : جميل أن نرى الإعلام يسلط الضوء على الخير.",
            "محمد : قصة ملهمة فعلًا، تبعث الأمل في الناس.",
            "فارس: القصة بعثت الدفء في قلبي."
        ],
        options: [
            { text: 'أخبرتك بأني أجيد عملي!', nextId: 26, score: 0 },
        ],
    },
    {
        id: 18,
        botMessage: ' التعليقات إيجابية ، استمر !',
        publicComments: [
            "مريم : قصة عظيمة ببساطتها.",
            "محمد : كم نغفل عن أبطال بيننا لا يتحدثون!.",
            "فارس: لامست القصة قلبي فعلًا."
        ],
        options: [
            { text: 'رائع!', nextId: 26, score: 0 },
        ],
    },
    {
        id: 19,
        botMessage: 'الشك في المعلومة يتصاعد والآراء تتجه في دوائر لا تنتهي ',
        publicComments: [
            "مريم : لو كان الخبر صحيحًا، لعرف به العالم كله.",
            "محمد : ماهي مصادرك؟ اذكرها!",
            "فارس : اين المصدر الطبي ؟"
        ],
        options: [
            { text: 'لننتقل بهدوء للتالي', nextId: 26, score: 0 },
        ],
    },
    {
        id: 20,
        botMessage: '  يبدو  أن الجمهور في حالة رضا تام استمر بهذا الإتزان ! ',
        publicComments: [
            "مريم : التطور مدهش، تحتاج فقط أن نتأقلم.",
            "محمد : أخيرًا التقنية تخدم الإنسان لا العكس !",
            "فارس : الذكاء الاصطناعي سيخلق فرصًا جديدة أكثر من التي سيأخذها."
        ],
        options: [
            { text: 'مستعد للخطوة التالية', nextId: 26, score: 0 },
        ],
    },
    {
        id: 21,
        botMessage: '.يبدو أنك اثرت الجدل... دعنا نذهب للخطوة التالية',
        publicComments: [
            "مريم : التفاصيل غامضة.",
            "محمد : هل هناك ادلة فعلية على هذا الكلام؟",
            "فارس : تجاوزت الحدود قليلًا!"
        ],
        options: [
            { text: 'حسنا ....', nextId: 26, score: 0 },
        ],
    },
    {
        id: 22,
        botMessage: 'انقسام واضح في الآراء، هذا يعني أن محتواك حرّك النقاش.حافظ على هذا الإيقاع !',
        publicComments: [
            "مريم :  تحتاج إلى المزيد من هذه المشاريع.",
            "محمد : أحببت اللغة الإيجابية في الطرح.",
            "فارس : تقرير جميل !"
        ],
        options: [
            { text: 'تم تسجيل الملاحظة', nextId: 26, score: 0 },
        ],
    },
    {
        id: 23,
        botMessage: '.يبدو أن الخوف لم يعد سيد الموقف',
        publicComments: [
            "مريم : العنوان مرعب، نحتاج للتفاصيل!.",
            "محمد : أين المصادر ؟!",
            "فارس :  كفى تهويلًا !"
        ],
        options: [
            { text: '...', nextId: 26, score: 0 },
        ],
    },
    {
        id: 24,
        botMessage: 'يا لها من طاقة مشرقة تنعكس في التعليقات توحى بأن التفاعل القادم سيكون أكثر إشراقًا',
        publicComments: [
            "مريم : خطوة جميلة في تطوير التعليم.",
            "محمد:هذا رائع! كيف سيطبق النظام ؟",
            "فارس:  مبادرة رائعة تعزز التعلم الذاتي. "
        ],
        options: [
            { text: 'متشوق للتالي', nextId: 26, score: 0 },
        ],
    },
    {
        id: 25,
        botMessage: 'يبدو أن الجمهور بات أكثر وعيًا بما ينشر، تذكر أن المصداقية هي أساس الثقة بالإعلام .',
        publicComments: [
            "مريم : مصدر مجهول؟ إذًا الخبر بلا أساس",
            "محمد : مثل هذه الأخبار تضعف الثقة بالإعلام!",
            "فارس : هل يُعقل أن ينتشر خبر كهذا بلا دليل؟!"
        ],
        options: [
            { text: 'لا أخبار مزيفة بعد الآن', nextId: 26, score: 0 },
        ]
    },
    {
        id: 26,
        botMessage: '     اوه أنظر...هناك شائعة متداولة على مواقع التواصل عن إغلاق جامعة شهيرة، هل ترغب في تغطية الموضوع ؟',
        options: [
            { text: 'أنشر الخبر فورًا مع عنوان مثير', nextId: 27, score: -5 },
            { text: 'تحقق من مصدر رسمي قبل النشر', nextId: 28, score: 10 },
        ],
    },
    {
        id: 27,
        botMessage: ' يبدو أنك تفضل الإثارة على الدقة ! ',
        options: [
            { text: 'التالي', nextId: 29, score: 0 },
        ],
    },
    {
        id: 28,
        botMessage: ' تصرف مسؤول يدل على وعي إعلامي !',
        options: [
            { text: 'التالي', nextId: 30, score: 0 },
        ],
    },
    {
        id: 29,
        botMessage: 'أصدرت الجامعة بيانًا رسميًا الآن تنفي فيه الشائعة تمامًا الكرة في ملعبك أيها الصحفي ماذا ستفعل ؟',
        options: [
            { text: 'أنشر توضيحًا وأعتذر عن الخطأ.', nextId: 31, score: 10 },
            { text: 'تجاهل البيان', nextId: 32, score: -5 },
        ],
    },
    {
        id: 30,
        botMessage: 'لقد تلقيت ردًا رسميًا من الجامعة يوضح حقيقة المعلومة التي انتشرت.الآن أمامك قرار مهم .... ماذا ستفعل ؟',
        options: [
            { text: 'أنشر التوضيح الرسمي. لتصحيح المعلومة', nextId: 33, score: 10 },
            { text: 'أحتفظ بالمعلومة لنفسي', nextId: 34, score: -5 },
        ],
    },
    {
        id: 31,
        botMessage: '! قرار صائب ، يقدر الجمهور صراحتك',
        options: [
            { text: 'أن تحمل المسؤولية ليس بالأمر الصعب . ', nextId: 35, score: 0 },
            { text: 'نجوت هذه المرة.', nextId: 35, score: 0 },
        ],
    },
    {
        id: 32,
        botMessage: '.  قرار جريء... لكن ليس ذكياً ! مصداقيتك تراجعت',
        options: [
            { text: 'حسنًا ربما الجرأة ليست كل شيء....', nextId: 35, score: 0 },
        ],
    },
    {
        id: 33,
        botMessage: 'لقد قمت بواجبك كما ينبغي !',
        options: [
            { text: 'لتحتفل بنجاحي !', nextId: 35, score: 0 },
        ],
    },
    {
        id: 34,
        botMessage: 'الصحفي المسؤول لا يكتفي بمعرفة الحقيقة ، بل يشاركها في الوقت. المناسب !',
        options: [
            { text: 'أفضل ألا أتدخل...', nextId: 35, score: 0 },
        ],
    },
    {
        id: 35,
        botMessage: 'بعد كل ما حدث، تشعر بأن دمك بدأ يغلي من كل تلك القرارات الصعبة ؟',
        options: [
            { text: 'ربما ... لكن قلبي الصحفي لا يعرف التوقف.', nextId: 36, score: 0 },
            { text: 'أغلي ؟ لا، أنا فقط أتبخر من شدة التفكير.', nextId: 36, score: 0 },
        ],
    },
    {
        id: 36,
        botMessage: 'حسنا، تذكر أن الصحافة ليست مجرد كشف الحقائق... أحيانًا هي رياضة أكروبات ذهنية!',
        options: [
            { text: 'أكروبات ذهنية ؟ وهل هناك شهادة سلامة لهذه اللعبة ؟', nextId: 37, score: 0 },
            { text: 'هل سأحتاج مدربًا أم خوذة واقية فقط؟', nextId: 37, score: 0 },
        ],
    },
    {
        id: 37,
        botMessage: 'لا تقلق، خوذتك الوحيدة هي مصداقيتك وحسك النقدي... استعد للمرحلة القادمة!',
        options: [
            { text: 'خوذتي جاهزة....', nextId: 38, score: 0 },
            { text: 'استعد؟ لحظة، هل هناك خيار للهروب ؟', nextId: 38, score: 0 },
        ],
    },
    {
        id: 38,
        botMessage: 'ماذا لدينا الآن.... يبدو أن مقطع جديد لمغني شهير بدأ ينتشر بسرعة! الجمهور منقسم بين الضحك والنقد، ووسائل التواصل مليئة بالتعليقات.كيف تتصرف قبل كتابة مقال ؟',
        options: [
            { text: 'أكتب مقالًا قصيرًا لجذب القراء بسرعة.', nextId: 39, score: -5 },
            { text: 'أراقب ردود الفعل وأحلل الاتجاهات بعناية', nextId: 43, score: 10 },
        ],
    },
    {
        id: 43,
        botMessage: 'ممتاز ! متابعة ردود الفعل تمنحك صورة واضحة عن الاتجاهات والآراء.',
        options: [
            { text: 'التالي', nextId: 44, score: 0 },
        ],
    },
    {
        id: 44,
        botMessage: 'ماذا تريد أن تفعل بعد جمع المعلومات ؟',
        options: [
            { text: 'أدمج تحليلات الجمهور في مقال متوازن.', nextId: 45, score: 10 },
            { text: 'أنشر الفيديو مع تعليق فكاهي', nextId: 46, score: -5 },
        ],
    },
    {
        id: 45,
        botMessage: 'أسلوبك مهني ويوازن بين التحليل والتأثير.',
        options: [
            { text: 'تعلمت من الأفضل !', nextId: 47, score: 0 },
        ],
    },
    {
        id: 46,
        botMessage: 'اختيار يبدو مغريًا للوهلة الأولى، لكنه قد يضر بمصداقيتك الصحفية.',
        options: [
            { text: 'ماذا تبقى من مصداقيتي....', nextId: 47, score: 0 },
        ],
    },
    {
        id: 39,
        botMessage: 'نشر الخبر بسرعة قد يضر بمصداقيتك!',
        options: [
            { text: 'التالي', nextId: 40, score: 0 },
        ],
    },
    {
        id: 40,
        botMessage: 'لديك فرصة لتصحيح المسار',
        options: [
            { text: 'أعتذر للقراء واحلل الإتجاهات قبل كتابة مقال جديد.', nextId: 41, score: 10 },
            { text: 'أضاعف المقالات السريعة لجذب التفاعل أكثر', nextId: 42, score: -5 },
        ],
    },
    {
        id: 41,
        botMessage: 'ممتاز قررت التعامل بحكمة بعد الخطأ السابق.',
        options: [
            { text: 'التعلم من الأخطاء جزء من اللعبة، اليس كذلك ؟', nextId: 47, score: 0 },
        ],
    },
    {
        id: 42,
        botMessage: '!تكرار المغامرات السريعة يقلل من مصداقيتك أكثر',
        options: [
            { text: 'أعدك أنها آخر مرة أتهور فيها.', nextId: 47, score: 0 },
        ],
    },
    // ---------------------------------------------------
    {
        id: 47,
        botMessage: 'بعد أن تجاوزنا الموقف السابق بسلام... يلوح أمامنا تحدٍ جديد. فقد أعلنت منصة تسوق الكترونية عن خلل تقني تسبب في إلغاء عدد كبير من الطلبات، من دون أي تفاصيل إضافية. والغضب يزداد في التعليقات',
        options: [
            { text: 'أعتمد على ما يقوله المستخدمون.', nextId: 48, score: -5 },
            { text: 'أطلب توضيحًا رسميًا من المنصة.', nextId: 52, score: 10 },
        ],
    },
    {
        id: 48,
        botMessage: 'يجدر بك أن تتذكر أن بعضهم يكتب على عجل، وبعضهم تحت تأثير الانفعال!',
        options: [
            { text: 'التالي', nextId: 49, score: 0 },
        ],
    },
    {
        id: 49,
        botMessage: 'مهلًا ، ظهر حساب يزعم أنه المنصة ونشر تفسيرًا عاجلًا. ما خطواتك ؟',
        options: [
            { text: 'أتحقق من صحة الحساب أولًا.', nextId: 50, score: 10 },
            { text: 'أتعامل مع التفسير مباشرة.', nextId: 51, score: -5 },
        ],
    },
    {
        id: 50,
        botMessage: 'التثبيت خطوة ترفع عنك الكثير من المتاعب لاحقًا، فقد تبين أن الحساب ليس رسميًا',
        options: [
            { text: 'لنبني الخبر على المنشور الرسمي', nextId: 56, score: 0 },
        ],
    },
    {
        id: 51,
        botMessage: 'حدث ما كان لابد من توقيه، تبين أن الحساب غير رسمي.',
        options: [
            { text: 'حسنًا ... يبدو أن علي الترفق مع الأسماء المتشابهة .', nextId: 56, score: 0 },
        ],
    },
    {
        id: 52,
        botMessage: 'خطوة موفقة بدأت تبني قصتك على أساس متين.',
        options: [
            { text: 'التالي', nextId: 53, score: 0 },
        ],
    },
    {
        id: 53,
        botMessage: 'وصلنا الآن رد من المنصة لكنه قصير ... قصير جدًا لدرجة أنه لا يكفي لعنوان فرعي.ماذا تفعل الآن ؟',
        options: [
            { text: 'أطلب منهم إيضاحًا أوسع.', nextId: 54, score: 10 },
            { text: 'أنشر ما وردني.', nextId: 55, score: -5 },
        ],
    },
    {
        id: 54,
        botMessage: 'طلب في محله .... ويبدو أن الموظف شعر بالحرج قليلًا فقد حصلت على رد أوضح !',
        options: [
            { text: 'لننشر التقرير إذًا.', nextId: 56, score: 0 },
        ],
    },
    {
        id: 55,
        botMessage: 'يبدو أنك قررت التعامل مع الرد كما هو خطوة.. جريئة.',
        options: [
            { text: 'أمضي قدمًا ... فلعل الجرأة تفتح بابًا لم أتوقعه.', nextId: 56, score: 0 },
        ],
    },
    // -------------------------------------------------------
    {
        id: 56,
        botMessage: 'حسناً... يبدو أن روحك المعنوية مازالت سليمة. وهذا أمر نادر في يومِ مليء بالمفاجآت',
        options: [
            { text: 'أحاول الحفاظ عليها.', nextId: 57, score: 0 },
            { text: 'إنهياري مؤجل .... ربما إلى نهاية اليوم', nextId: 57, score: 0 },
        ],
    },
    {
        id: 57,
        botMessage: 'ممتاز... قبل أن يظهر موقف جديد، أود أن أعرف إن كنت ما تزال مستعدًا لمواصلة هذا الإيقاع.',
        options: [
            { text: 'مستعد', nextId: 58, score: 0 },
            { text: 'أعتقد ذلك', nextId: 58, score: 0 },
        ],
    },
    {
        id: 58,
        botMessage: 'جيّد... لنرى ما سيظهر أمامنا في الخطوة التالية.',
        options: [
            { text: 'التالي', nextId: 59, score: 0 },
        ],
    },
    // --------------------------------------------------------
    {
        id: 59,
        botMessage: 'يبدو أن الصباح قرر أن يمنحك لغزًا صغيرًا! نشرت إحدى الجهات الصحية تنبيها مقتضبًا جدًا، جملة قصيرة لا تقول الكثير... لكنها بالتأكيد تعني شيئًا مهمًا.كيف تتصرف قبل صياغة خبر عنه ؟',
        options: [
            { text: 'أحلل التنبيه وأضع تفسيرًا منطقيًا لطبيعته في الخبر.', nextId: 60, score: -5 },
            { text: 'أذكر التنبيه كما هو.', nextId: 68, score: 10 },
        ],
    },
    {
        id: 60,
        botMessage: 'الخبر يجب أن يبنى على معلومة وليس على تخمين.',
        options: [
            { text: 'التالي', nextId: 61, score: 0 },
        ],
    },
    {
        id: 61,
        botMessage: 'لا بأس، أمامك فرصة لإصلاح المسار',
        options: [
            { text: 'أتراجع عن التحليل وأعيد صياغة الخبر بنقل التنبيه  فقط .', nextId: 62, score: 10 },
            { text: 'أبني على التحليل توقعات إضافية', nextId: 65, score: -5 }
        ],
    },
    {
        id: 62,
        botMessage: 'التراجع خطوة تعيد للخبر توازنه وتمنحك مصداقية أعلى، خطوة محسوبة. لكن كيف سنتعامل مع الجمهور الذي شاهد النسخة الأولى؟',
        options: [
            { text: 'أوضح للجمهور أنه تم تحديث الخبر لتصحيح المعلومة.', nextId: 63, score: 10 },
            { text: 'أي نسخة أولى تتحدث عنها ؟', nextId: 64, score: -5 },
        ],
    },
    {
        id: 63,
        botMessage: 'الاعتراف بالتعديل يعزز المصداقية ،والجمهور يقدر الشفافية.',
        options: [
            { text: 'حسنًا  ... سأواجه الجمهور بجرأة صحفي لا بخفة مراوغ..', nextId: 76, score: 0 },
        ],
    },
    {
        id: 64,
        botMessage: 'التجاهل قد ينجح أحيانًا ... لكن الشفافية هي الخيار الأفضل',
        options: [
            { text: 'لا مهرب من الصراحة إذن!', nextId: 76, score: 0 },
        ],
    },
    {
        id: 65,
        botMessage: 'بهذه الطريقة تصنع قصة لا أساس لها .... ما زال بإمكانك تعديل مسارك قبل أن يتعقد الوضع أكثر',
        options: [
            { text: 'أوضح للقارئ بأن هذه مجرد قراءة أولية وليست معلومات مؤكدة.', nextId: 66, score: 10 },
            { text: 'استخدم التوقعات التي . كتبتها كمصدر داخلي', nextId: 67, score: -5 },
        ],
    },
    {
        id: 66,
        botMessage: 'وضع ملاحظة للقارئ يمنحك مساحة آمنة ويمنع مبالغات غير مقصودة.',
        options: [
            { text: 'ملاحظة صغيرة أنقذتني من ورطة كبيرة!', nextId: 76, score: 0 },
        ],
    },
    {
        id: 67,
        botMessage: 'ما لم يكن هناك مصدر حقيقي، فأنت تصنع معلومة من العدم.....',
        options: [
            { text: 'يبدو أن خيالي أنشط مما ينبغي', nextId: 76, score: 0 },
        ],
    },
    {
        id: 68,
        botMessage: 'خيار حذر ومهني، لم تفسر النص ولم تتجاوز ما قيل.',
        options: [
            { text: 'التالي', nextId: 69, score: 0 },
        ],
    },
    {
        id: 69,
        botMessage: 'لكن الغموض ما زال موجودًا ... وعليك اتخاذ خطوة ثانية للتعامل معه.',
        options: [
            { text: 'أطلب من الجهة الصحية توضيحًا رسميًا حول مغزى التنبيه.', nextId: 70, score: 10 },
            { text: 'اعتمد على تعليقات الجمهور لتفسير التنبيه.', nextId: 73, score: -5 },
        ],
    },
    {
        id: 70,
        botMessage: 'الرجوع للمصدر يضمن دقة أعلى ويمنح الخبر وزنًا أكبر. لكن كيف ستتعامل مع طريقة عرض التوضيح للجمهور؟',
        options: [
            { text: 'أقدم التوضيح بصيغته الرسمية دون تعديل', nextId: 71, score: 10 },
            { text: 'أعيد صياغة التوضيح بأسلوبي الخاص لأجعله أكثر جاذبية', nextId: 72, score: -5 },
        ],
    },
    {
        id: 71,
        botMessage: 'رائع! احتفظت بروح البيان كما هو.',
        options: [
            { text: 'لم أشأ العبث ببيان الجهة.', nextId: 76, score: 0 },
        ],
    },
    {
        id: 72,
        botMessage: 'الجاذبية مهمة ... لكن الدقة أهم بكثير.',
        options: [
            { text: 'أنت محق... لعلي بالغت', nextId: 76, score: 0 },
        ],
    },
    {
        id: 73,
        botMessage: 'يبدو أن الحماس أخذك إلى ساحة. التعليقات بدل المصادر! مازال بإمكانك تصحيح خط سير الخبر',
        options: [
            { text: 'أفصل بين رأي الجمهور والخبر.', nextId: 74, score: 10 },
            { text: 'تضيف تعليقًا آخر من الجمهور لزيادة التفاعل', nextId: 75, score: -5 },
        ],
    },
    {
        id: 74,
        botMessage: '.فصل رأي الجمهور عن الخبر يوضح للقارئ  الفرق بين ما قيل وما ثبت',
        options: [
            { text: '.إذًا ... سأدع الآراء تتحدث وحدها، وأبقى أنا مع الحقائق', nextId: 76, score: 0 },
        ],
    },
    {
        id: 75,
        botMessage: 'الصحافة ليست سباقًا للتفاعل ... .بل للدقة!',
        options: [
            { text: '.علي أن اعود للدقة', nextId: 76, score: 0 },
        ],
    },
    {
        id: 76,
        botMessage: 'ها قد هدأ المكان... وكأن الأخبار قررت أخيرًا أن تمنحنا دقيقة حياة. ما الذي يدور في بالك الآن ؟',
        options: [
            { text: '.أظن أن الأخبار تراقبني .... لا أنا أراقبها', nextId: 77, score: 0 },
        ],
    },
    {
        id: 77,
        botMessage: 'هذه طبيعة المهنة ... تتدافع الأحداث كما لو أنها تتنافس على من يصل إليك أولًا.',
        options: [
            { text: 'سأغادر الآن.... قبل أن تعثر عليّ الأخبار', nextId: null, score: 0 },
        ],
    },
]
